# Pandas - Data Frames

DataFrames con diccionarios:

In [1]:
import pandas as pd
import numpy as np

data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

Modificar el orden de las columnas:

In [3]:
pd.DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

## Análisis preliminar de datos:

In [7]:
df = pd.read_csv('adult_data.csv')
df.shape  # Ver la cantidad de filas y columnas

(32561, 15)

In [8]:
df.head(3) #Visualizar los primeros 3 registros
#df.tail(3) --> Ver los último 3 registros

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K

In [9]:
df.dtypes #Columnas con el tipo de dato

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
salary            object
dtype: object

In [11]:
df1 = df[['age', 'education', 'occupation', 'sex', 'salary']] #DF con las columnas elegidas
df1.head(5)

   age  education         occupation     sex salary
0   39  Bachelors       Adm-clerical    Male  <=50K
1   50  Bachelors    Exec-managerial    Male  <=50K
2   38    HS-grad  Handlers-cleaners    Male  <=50K
3   53       11th  Handlers-cleaners    Male  <=50K
4   28  Bachelors     Prof-specialty  Female  <=50K

Trabajar con datos faltantes:

In [3]:
dfTitanic = pd.read_csv('titanic.csv')
dfTitanic.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S

In [13]:
dfTitanic.describe() #Estadística por cada columnna. Medidas de tendencia central y medidas de dispersión

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
dfTitanic.shape

(891, 12)

In [15]:
dfTitanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Eliminar filas con NaN:

In [14]:
#titanic1 = dfTitanic.dropna(axis = 0, how = 'all') --> Elimina filas que posean NaN en TODAS sus columnas
titanic1 = dfTitanic.dropna(axis = 0, how = 'any') #Elimina filas que posean AL MENOS un NaN
titanic1.shape

(183, 12)

Rellenar datos NaN:

Contar la cantidad de los valores faltantes de una columna:

In [8]:
pd.isnull(dfTitanic['Age']).values.ravel().sum()

177

Rellenar con el promedio de todas las edades:

In [14]:
col = dfTitanic['Age'].fillna(dfTitanic['Age'].mean())
col.head(6) #En el 6 registro se ve el promedio de las edades

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
Name: Age, dtype: float64

Agregar una nueva columna con los datos de col

In [15]:
dfTitanic['NewAge'] = col 
dfTitanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'NewAge'],
      dtype='object')

# One Hot Encoding
Los modelos de Machine Learning necesitan procesar valores numéricos. En ciertos casos vamos a realizar análisis en las que existen variables categóricas (País, Sexo, Ciudad, etc.)
Esta técnica convierte estas variables categóricas en variables numéricas

In [5]:
titanic1.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [15]:
titanic1 = titanic1[['PassengerId', 'Name', 'Sex', 'Age']]
titanic1.head(3)

,PassengerId,Name,Sex,Age
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
6,7,"McCarthy, Mr. Timothy J",male,54.0

In [16]:
dummy_sex = pd.get_dummies(titanic1['Sex'], prefix = 'sex')
dummy_sex.head(3)

   sex_female  sex_male
1           1         0
3           1         0
6           0         1

In [17]:
titanic1 = titanic1.drop(['Sex'], axis = 1)
titanic2 = pd.concat([titanic1, dummy_sex], axis = 1)
titanic2.head(3)

,PassengerId,Name,Age,sex_female,sex_male
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0
6,7,"McCarthy, Mr. Timothy J",54.0,0,1

In [18]:
titanic2.shape

(183, 5)

In [ ]:
def createDummies(df, varname):
    dummy = pd.get_dummies(df[varname], prefix=varname)
    df = df.drop(varname, axis=1)
    df = pd.concat([df, dummy], axis=1)
    return df

#createDummies(dataframe, 'columna') al dataframe le elimina columna y realiza un one hot encoding